/* 
   Function:    音乐播放器
   Authur  ：   Luo0412
   Build_Date:  2016-2-6    
*/

//[1]定义区.................................................
//..........................................................

/*Part1 获取id值*/
var ctx = document.getElementById('canvas').getContext('2d');  //获取canvas元素
drawLine(0,300,300,300);
drawLine(300,0,300,360);
drawLine(300,114,750,114);




var ap3 = new APlayer({
        element: document.getElementById('player3'),
        narrow: false,
        autoplay: false,
        showlrc: true,
        music: {
            title: '出塞',
            author: '贰婶',
            url: 'audio/00.mp3',
            pic: 'images/pf.jpg'
        }
    });
ap3.init();
$(window).load(function() {
    $('#featured').orbit();
});

//[2]函数区................................................
//.........................................................


//[3]注册区.................................................
//..........................................................


//[4]初始化区............................................
//.......................................................


